{
  "bannerTitle": "WELCOME TO MY PORTFOLIO!",
  "name": "const author = **'Ezequiel Coeli'**;",
  "profile": "Profile",
  "profileDescription": "Software testing professional with experience in manual and automated testing, encompassing the design and execution of test cases while working with project management tools.\n\n I have solid knowledge of object-oriented programming and good development practices, which allows me to understand software logic and contribute to improving its quality with a DevOps approach.\n\n I stand out for my attention to detail, analytical skills, and efficient problem-solving. I work well in teams and adapt quickly to new environments and methodologies. Additionally, I maintain a strong commitment to continuous learning in the field of testing and programming.",
  "experience": "Experience",
  "experienceDescription1": "Since 2021, I have been working as a software tester at uTest, taking part in numerous quality assurance projects for web, mobile, and desktop applications, as well as conducting tests on physical devices to validate the integration between hardware and software.\n\n My work involves carrying out functional, regression, exploratory, usability, localisation, smoke, and in-home testing, with the aim of detecting issues at an early stage and enhancing the end-user experience. I place great importance on the quality of bug reports and documentation, recording reproduction steps, evidence, and severity levels to ensure clear communication with development teams.",
  "experienceDescription2":"In addition to my experience in manual testing, I have worked on test automation, creating frameworks with Selenium, Java, and Cucumber, and developing E2E tests with Cypress. I have also designed and executed performance tests with JMeter and BlazeMeter, validated APIs with Postman and Newman, and performed cross-platform compatibility testing using BrowserStack.\n\n Thanks to this combination of manual and automated testing, I have built a strong profile in Quality Assurance, with a comprehensive approach that covers everything from identifying user experience issues to technical validation of performance and system integration.",
  "projects": "Projects",
  "products": "Products",
  "testCycles": "Test Cycles",
  "viewGithubProjects": "View my GitHub projects",
  "contact": "Contact",
  "light": "Light",
  "dark": "Dark",
  "allRightsReserved": "© 2025 All rights reserved"
}
