{
  "bannerTitle": "BIENVENIDOS A MI PORTFOLIO!",
  "name": "const author = **'Ezequiel Coeli'**;",
  "profile": "Perfil",
  "profileDescription": "Soy un profesional de **pruebas de software** con experiencia en **testing manual** y **automatizado**, incluyendo el diseño y ejecución de casos de prueba y el manejo de herramientas de **gestión de proyectos**.\n\n Poseo conocimientos en **programación** y buenas prácticas de desarrollo, lo que me permite **comprender la lógica del software** y contribuir a la mejora de su calidad con un enfoque **DevOps**.\n\n Me destaco por mi **atención al detalle, capacidad analítica y resolución de problemas**. Trabajo bien en equipo, me adapto rápido a nuevos entornos y metodologías, y mantengo un fuerte compromiso con el **aprendizaje continuo en testing y programación**.",
  "experience": "Experiencia",
  "experienceDescription1": "Desde **2021**, me desempeño como **tester de software**, participando en proyectos de **aseguramiento de calidad** para **aplicaciones web, móviles y de escritorio**, además de pruebas en **dispositivos físicos**, asegurando la correcta integración entre hardware y software.\n\nRealizo **pruebas funcionales**, de **regresión**, **exploratorias**, de **usabilidad**, de **localización**, **smoke testing** e **in-home testing**, enfocándome en detectar errores tempranamente y mejorar la **experiencia del usuario**. Me destaco por la **calidad en la documentación de incidencias**, registrando pasos de reproducción, evidencias y niveles de severidad para una comunicación clara con los equipos de desarrollo.",
  "experienceDescription2": "Además de mi experiencia en **pruebas manuales**, he trabajado en **automatización de pruebas**, desarrollando flujos de pruebas **end-to-end** y evaluando la **performance y estabilidad** de aplicaciones en diferentes entornos. También he diseñado y ejecutado **pruebas de compatibilidad multiplataforma** y validado la **integración de sistemas** de manera exhaustiva.\n\nEsta combinación de **pruebas manuales y automatizadas** me ha permitido consolidar un **perfil sólido en Quality Assurance**, con un enfoque integral que abarca desde la **detección temprana de errores en la experiencia del usuario** hasta la **optimización del rendimiento y la confiabilidad del software**.",
  "projects": "Proyectos",
  "managerPlaneToolDescription": "Manager Plane Tool es una aplicación web para la gestión eficiente de inventarios tecnológicos mediante planos visuales personalizables. Permite crear zonas, añadir dispositivos con información detallada y asignarlos a ubicaciones precisas usando coordenadas. Construida con React, JavaScript, TailwindCSS y Konva.js, ofrece herramientas de dibujo, creación de formas, sistema de capas, categorización de dispositivos e interfaz drag-and-drop. El desarrollo incluyó retos como implementar un sistema de coordenadas preciso, optimizar el renderizado, y gestionar estados complejos.",
  "products": "Productos",
  "testCycles": "Ciclos de Pruebas",
  "viewGithubProjects": "Ver repositorios en GitHub",
  "contact": "Contacto",
  "light": "Claro",
  "dark": "Oscuro",
  "allRightsReserved": "© 2025 Todos los derechos reservados",
  "viewProject": "Ver Proyecto",
  "webDev": "Desarrollo Web",
  "deployChatDescription": "Deploy-Chat es un proyecto con vibes retro y esencia dev: una plataforma de chat enfocada en equipos de trabajo, con temas estilo terminal, syntax highlighting, IA integrada y encriptación E2E. Construido con React 19 + Vite, Supabase y TailwindCSS, ofrece chat en tiempo real, autenticación OAuth, internacionalización ES/EN, notas, búsqueda y agenda de eventos. El desarrollo implicó aprender sobre seguridad a nivel de filas, gestión de estado con hooks, optimización de comunicación en tiempo real, encriptación y arquitectura escalable.",
  "clickToSeeInGitHub": "Haz clic para ver en GitHub",
  "clickToSeeInSite": "Haz clic para acceder al sitio",
  "tecnologies": "Tecnologías",
  "automation": "Automatización",
  "apiTesting": "API y Rendimiento",
  "projectManagement": "Gestión de Proyectos",
  "mobileDesktop": "Móvil y Multiplataforma",
  "otherTools": "Otras Herramientas",
  "toolFrameDescription": "Tool Frame es una aplicación web moderna para la gestión y descubrimiento de herramientas de desarrollo en general. Permite agregar y eliminar herramientas, con búsqueda inteligente en tiempo real, filtrado por categorías, y vista previa. Construida con React 18, Vite y TailwindCSS, ofrece internacionalización ES/EN, diseño responsive, persistencia con LocalStorage y UI moderna con animaciones fluidas."
}
